<?php
/**
 * (с) 2007 <META>
 * 
 * Библиотека поставляется как есть. 
 * Вы используете эту библиотеку на свой страх и риск.
 * 
 * Зачем использовать эту библиотеку?
 * 
 * - при изменении формата xml-ля прайс-листа, вам нужно будет только обновить библиотеку.
 * - экранирует все специальные символы за вас
 * - следит за порядком элементов, вам об этом не нужно задумываться
 * - может работать с большим кол-вом товаров
 * 
 * Замечания по работе библиотеки можно направлять на info@metamarket.com.ua
 * 
 */

/**
 * Подключение библиотеки
 */
require_once './META_Export.class.php';

// Отключаем вывод ошибок
ini_set('display_errors', false);

/**
 * Для примера создаем подключение к базе данных
 */
mysql_connect('localhost', 'DK', '*****');
mysql_select_db('mrkt');

/**
 * Опции
 * 
 * Если вы не указываете название магазина то будет использовано название market
 * Если вы не указываете кодировку по-умолчанию будет использоваться WINDOWS-1251
 * 
 * Если вы указываете имя файла то прайс-лист будет сохранен в этот файл. Внимание! Убедитесь, что
 * в файл ваш скрипт может писать.
 * Если вы не указываете имя файла или указываете имя файла как null или false или '',
 * то прайс-лист будет выведен прямо в браузер или консоль или стандартный вывод,
 * зависит от того, как вы вызвали скрипт.
 */
$options = array(
	'market_name'	=> 'market',		// Название вашего магазина 
	'encoding'		=> 'WINDOWS-1251',	// Кодировка
//	'file_name'		=> './price.xml',
	'file_name'		=> null,			// Имя файла
);

/**
 * Инициализируем библиотеку
 */
$price = new META_export( $options );

/**
 * Начинаем создание прайс-листа.
 * Этот метод вызывать обязательно.
 */
$price->start();

/**
 * Например делаем выборку наших категорий из базы данных так
 */
$sSQL	= 'SELECT categories_id as id, parent_id as parent, title as name FROM categories LIMIT 10';
$result = mysql_query($sSQL);

while( $category = mysql_fetch_assoc($result) ) {	
	/**
	 * Внимание! Добавление элементов нужно делать в том порядке, в котором оно приводится
	 * здесь, тоесть сначала категории, потом валюты, потом товары.
	 * 
	 * Добавляем категории.
	 * Вы должны обязательно указать ИД(номер) и название категории. ИД должен быть уникальным!
	 * 
	 * Вы должны добавить хотя бы одну категорию.
	 */
	$price->addCategory(
		array(
			'id'	=> $category['id'], // ИД
			'name'	=> $category['name'], // Название категории
			'parent'	=> $category['parent'], // ИД родительской категории если есть
		)
	);	
}

/**
 * Например делаем выборку курсов валют так
ё */
$sSQL = 'SELECT currency_name as name, currency_value as value FROM currency WHERE market_id=0';
$result = mysql_query($sSQL);

while( $currency = mysql_fetch_assoc($result) ) {
	/**
	 * Добавляем валюты.
	 * Вы должны обязательно указать буквенный код(название) валюты и коэффицент относительно гривны.
	 * К примеру, коэффициент для доллара(USD) может быть 5.05.
	 * Название валюты может быть UAH, RUB, USD, GBP, EUR.
	 * 
	 * Вы должны добавить хотя бы один курс. 
	 */	
	$price->addCurrency(
		array(
			'name'	=> $currency['name'],
			'value'	=> $currency['value'],
		)
	);
}

/**
 * Например делаем выборку товаров так
 */
$sSQL = 'select ' .
		'	i.item_id as id, i.categories_id as category, i.item_descr as description, i.item_url as click, i.item_pic as img, i.item_cost*i.currency_koef as price, v.vendor_name as vendor, i.model_name as name, i.type as type, i.priority as priority, "UAH" as currency  ' .
		'from items as i INNER JOIN vendor as v USING(vendor_id) LIMIT 100';
// Используем mysql_unbuffered_query для извлечения большого кол-ва строк из базы данных
$result = mysql_unbuffered_query($sSQL);

while( $offer = mysql_fetch_assoc($result) ) {
	/**
	 * Добавляем товары.
	 * Вы должны обязательно указать ИД категории, куда переходить на ваш сайт - click, название предложения - name,
	 * цену - price и валюту.
	 * 
	 * Внимание! Вам не нужно делать никаких преобразований для URL, экранирований и т.п. Библиоткека сделает все за вас.
	 * 
	 * Вы должны добавить хотя бы один товар
	 */
	$price->addOffer(
		array(
			'id'		=> $offer['id'],				// ИД товара
			'category'	=> $offer['category'],			// ИД категории в которой находится товар
			'priority'	=> $offer['priority'],			// Приоритет - пока не используется
			'img'		=> $offer['img'],				// Адрес(URL) картинки
			'click'		=> $offer['click'],				// Адрес(URL) куда должен перейти пользователь на ваш сайт при клике на товар
			'type'		=> $offer['type'],				// Тип товара, например - монитор
			'name'		=> $offer['name'],				// Название товара
			'currency'	=> $offer['currency'],			// Буквенный код валюты, например UAH
			'price'		=> $offer['price'],				// Цена товара в указаной валюте
			'description'	=> $offer['description'],	// Описание товара
		)
	);	
}

/**
 * Завершаем создание прайс-листа.
 * Этот метод вызывать обязательно.
 */
$price->end();

/**
 * Если вы указали название файла, результат работы скрипта будет сохранен в этот файл, и
 * вы можете вывести его содержимое так
 */
// $price->output();

?>
