<?php
//  ================================================================================================
// System : SEOCMS
// Module : mod_shop_export
// Version : 1.0.0
// Date : 10.09.2010
// Licensed To:   Yaroslav Gyryn
// Purpose    : Class definition for shop.stringRus.class
//  ================================================================================================

class stringRus {

    function strToUpRus($lo){
        $up=array("а" => "А","б" => "Б","в" => "В","г" => "Г","д" => "Д","е" => "Е","ж" => "Ж","з" => "З","и" => "И",
        "й" => "Й", "і" => "І", "ї" => "Ї", "к" => "К","л" => "Л","м" => "М","н" => "Н","о" => "О","п" => "П","р" => "Р","с" => "С",
        "т" => "Т","у" => "У","ф" => "Ф","х" => "Х","ц" => "Ц","ч" => "Ч","ш" => "Ш","щ" => "Щ","ъ" => "Ъ",
        "ы" => "Ы","ь" => "Ь","э" => "Э","ю" => "Ю","я" => "Я", "a" => "A", "b" => "B", "c" => "C","d" => "D","e" => "E","f" => "F","g" => "G","h" => "H","i" => "I","j" => "J",
        "k" => "K","l" => "L","m" => "M","n" => "N","o" => "O","p" => "P","q" => "Q","r" => "R","s" => "S",
        "t" => "T","u" => "U","v" => "V","w" => "W","x" => "X","y" => "Y","z" => "Z"
        );
        return strtr($lo, $up);
    }

    function strToLowerRus($up){
        $lo=array("А" => "а","Б" => "б","В" => "в","Г" => "г","Д" => "д","Е" => "е","Ж" => "ж","З" => "з","И" => "и",
        "Й" => "й",  "І" => "і", "Ї" => "ї","К" => "к","Л" => "л","М" => "м","Н" => "н","О" => "о","П" => "п","Р" => "р","С" => "с",
        "Т" => "т","У" => "у","Ф" => "ф","Х" => "х","Ц" => "ц","Ч" => "ч","Ш" => "ш","Щ" => "щ","Ъ" => "ъ",
        "Ы" => "ы","Ь" => "ь","Э" => "э","Ю" => "ю","Я" => "я",
        "A" => "a", "B" => "b", "C" => "c","D" => "d","E" => "e","F" => "f","G" => "g","H" => "h","I" => "i","J" => "j",
        "K" => "k","L" => "l","M" => "m","N" => "n","O" => "o","P" => "p","Q" => "q","R" => "r","S" => "s",
        "T" => "t","U" => "u","V" => "v","W" => "w","X" => "x","Y" => "y","Z" => "z"
        );
        return strtr($up, $lo);
    }

    /*function firstToUpRus($lo){
        if (preg_match("/^([a-zA-Zа-яА-Я]{1})(.*)$/", $lo, $fl))
            $up=$this->strToUpRus($fl[1]).$fl[2];
        else
            $up=$lo;
        return $up;
    }*/
}
?>
